##### Context and Content

A company which is active in Big Data and Data Science wants to hire data scientists among people who successfully pass some courses which conduct by the company. Many people signup for their training. Company wants to know which of these candidates are really wants to work for the company after training or looking for a new employment because it helps to reduce the cost and time as well as the quality of training or planning the courses and categorization of candidates. Information related to demographics, education, experience are in hands from candidates signup and enrollment.

This dataset designed to understand the factors that lead a person to leave current job for HR researches too. By model(s) that uses the current credentials,demographics,experience data you will predict the probability of a candidate to look for a new job or will work for the company, as well as interpreting affected factors on employee decision.

The whole data divided to train and test . Target isn't included in test but the test target values data file is in hands for related tasks. A sample submission correspond to enrollee_id of test set provided too with columns : enrollee _id , target


##### Features

enrollee_id : Unique ID for candidate

city: City code

city_ development _index : Developement index of the city (scaled)

gender: Gender of candidate

relevent_experience: Relevant experience of candidate

enrolled_university: Type of University course enrolled if any

education_level: Education level of candidate

major_discipline :Education major discipline of candidate

experience: Candidate total experience in years

company_size: No of employees in current employer's company

company_type : Type of current employer

lastnewjob: Difference in years between previous job and current job

training_hours: training hours completed

target: 0 – Not looking for job change, 1 – Looking for a job change

Inspiration
Predict the probability of a candidate will work for the company
Interpret model(s) such a way that illustrate which features affect candidate decision

##### Goal of the project

Prepare the model to predict whether someone is willing to change the job.

##### Minor goals
- Investigate the data
- Understand the data - search for insights, clues
- Preprocess the data, so it can be used later on by a machine learning model

In [1]:
# import the pandas library

import pandas as pd

In [2]:
# read the file with training data

file = 'data/aug_train.csv'
df = pd.read_csv(file)

In [3]:
# let's see the first 5 rows of the dataset

df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

##### Examining the data

We need to get a grasp of how big the dataset is. Also, we need to know how many cases we have for both cases we want to predict:
- people who want to change their job
- people who want to stay at their current workplace

In [4]:
df.describe()

        enrollee_id  city_development_index  training_hours        target
count  19158.000000            19158.000000    19158.000000  19158.000000
mean   16875.358179                0.828848       65.366896      0.249348
std     9616.292592                0.123362       60.058462      0.432647
min        1.000000                0.448000        1.000000      0.000000
25%     8554.250000                0.740000       23.000000      0.000000
50%    16982.500000                0.903000       47.000000      0.000000
75%    25169.750000                0.920000       88.000000      0.000000
max    33380.000000                0.949000      336.000000      1.000000

# Question: Did this output tell us anything? Conclusions?

In [5]:
df.shape

(19158, 14)

# Question: Is this enough? Can we expect to have our algorithm work properly? What else do we want to check?

In [6]:
df['target'] == 0

0        False
1         True
2         True
3        False
4         True
         ...
19153    False
19154    False
19155     True
19156     True
19157     True
Name: target, Length: 19158, dtype: bool

In [7]:
df['target'] == 1

0         True
1        False
2        False
3         True
4        False
         ...
19153     True
19154     True
19155    False
19156    False
19157    False
Name: target, Length: 19158, dtype: bool

In [8]:
df[df['target'] == 0].shape

(14381, 14)

In [9]:
df[df['target'] == 1].shape

(4777, 14)

# Question: What do we notice here? What does it tell us? Why it's important from the algorithm perspective?

### Investigation of columns
Let's investigate separate columns one by one.

##### Two ways of manipulating pandas dataframes:
- assign output of a function to a variable
- set *inplace* flag to True

In [10]:
# 1) sorted_df = df.set_index('enrollee_id').sort_index()
# 2) df.set_index('enrollee_id', inplace=True)

In [11]:
df = df.set_index('enrollee_id')

In [12]:
df.head()

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
enrollee_id,,,,,,,,,,,,,
8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [13]:
df = df.sort_index()

In [14]:
df.head()

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
enrollee_id,,,,,,,,,,,,,
1,city_103,0.920,Male,No relevent experience,no_enrollment,High School,NaN,2,NaN,Pvt Ltd,never,150,0.0
2,city_103,0.920,Male,No relevent experience,no_enrollment,Phd,STEM,15,10000+,NGO,3,128,1.0
4,city_103,0.920,Male,No relevent experience,no_enrollment,Masters,STEM,9,50-99,Public Sector,>4,13,0.0
5,city_67,0.855,Male,Has relevent experience,no_enrollment,Masters,STEM,10,<10,Early Stage Startup,1,12,0.0
7,city_136,0.897,Male,Has relevent experience,Full time course,Masters,STEM,13,NaN,NaN,1,18,0.0

# Question: Look at the rest of the columns: please answer what dtypes do their represent?

### Let's investigate the unique values for columns containing categorical variables

In [15]:
df.columns

Index(['city', 'city_development_index', 'gender', 'relevent_experience',
       'enrolled_university', 'education_level', 'major_discipline',
       'experience', 'company_size', 'company_type', 'last_new_job',
       'training_hours', 'target'],
      dtype='object')

In [16]:
df.head()

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
enrollee_id,,,,,,,,,,,,,
1,city_103,0.920,Male,No relevent experience,no_enrollment,High School,NaN,2,NaN,Pvt Ltd,never,150,0.0
2,city_103,0.920,Male,No relevent experience,no_enrollment,Phd,STEM,15,10000+,NGO,3,128,1.0
4,city_103,0.920,Male,No relevent experience,no_enrollment,Masters,STEM,9,50-99,Public Sector,>4,13,0.0
5,city_67,0.855,Male,Has relevent experience,no_enrollment,Masters,STEM,10,<10,Early Stage Startup,1,12,0.0
7,city_136,0.897,Male,Has relevent experience,Full time course,Masters,STEM,13,NaN,NaN,1,18,0.0

In [71]:
continous_columns = ['city_development_index', 'training_hours']

In [36]:
categorical_columns = ['city', 'gender', 'relevent_experience', 'enrolled_university', 'education_level', 'major_discipline', 'experience', 'company_size', 'company_type', 'last_new_job']

In [38]:
df[categorical_columns] = df[categorical_columns].astype('category')

In [39]:
df.dtypes

city                      category
city_development_index     float64
gender                    category
relevent_experience       category
enrolled_university       category
education_level           category
major_discipline          category
experience                category
company_size              category
company_type              category
last_new_job              category
training_hours               int64
target                     float64
dtype: object

In [40]:
df.head()

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
enrollee_id,,,,,,,,,,,,,
1,city_103,0.920,Male,No relevent experience,no_enrollment,High School,NaN,2,NaN,Pvt Ltd,never,150,0.0
2,city_103,0.920,Male,No relevent experience,no_enrollment,Phd,STEM,15,10000+,NGO,3,128,1.0
4,city_103,0.920,Male,No relevent experience,no_enrollment,Masters,STEM,9,50-99,Public Sector,>4,13,0.0
5,city_67,0.855,Male,Has relevent experience,no_enrollment,Masters,STEM,10,<10,Early Stage Startup,1,12,0.0
7,city_136,0.897,Male,Has relevent experience,Full time course,Masters,STEM,13,NaN,NaN,1,18,0.0

### Verify what kind of unique values exist in each column:

In [18]:
for col in categorical_columns:
    unique_items = df[col].unique().tolist()
    print(f'col name: {col}, unique_items: {unique_items}')

col name: city, unique_items: ['city_103', 'city_67', 'city_136', 'city_16', 'city_114', 'city_21', 'city_23', 'city_73', 'city_104', 'city_10', 'city_100', 'city_46', 'city_105', 'city_97', 'city_74', 'city_61', 'city_57', 'city_160', 'city_65', 'city_45', 'city_72', 'city_41', 'city_44', 'city_40', 'city_131', 'city_98', 'city_115', 'city_118', 'city_71', 'city_20', 'city_159', 'city_173', 'city_64', 'city_28', 'city_102', 'city_84', 'city_101', 'city_11', 'city_27', 'city_36', 'city_50', 'city_13', 'city_144', 'city_91', 'city_145', 'city_165', 'city_134', 'city_152', 'city_24', 'city_162', 'city_39', 'city_37', 'city_1', 'city_106', 'city_83', 'city_150', 'city_99', 'city_80', 'city_142', 'city_33', 'city_138', 'city_75', 'city_53', 'city_128', 'city_9', 'city_30', 'city_12', 'city_141', 'city_116', 'city_157', 'city_175', 'city_25', 'city_149', 'city_123', 'city_19', 'city_76', 'city_89', 'city_143', 'city_70', 'city_158', 'city_90', 'city_126', 'city_42', 'city_14', 'city_77', 'city_93', 'city_7', 'city_78', 'city_176', 'city_120', 'city_26', 'city_55', 'city_94', 'city_82', 'city_2', 'city_79', 'city_62', 'city_69', 'city_155', 'city_117', 'city_133', 'city_179', 'city_54', 'city_127', 'city_107', 'city_140', 'city_48', 'city_31', 'city_18', 'city_109', 'city_81', 'city_167', 'city_43', 'city_59', 'city_146', 'city_180', 'city_8', 'city_129', 'city_166', 'city_121', 'city_139', 'city_111', 'city_171']
col name: gender, unique_items: ['Male', 'Female', nan, 'Other']
col name: relevent_experience, unique_items: ['No relevent experience', 'Has relevent experience']
col name: enrolled_university, unique_items: ['no_enrollment', 'Full time course', 'Part time course', nan]
col name: education_level, unique_items: ['High School', 'Phd', 'Masters', 'Graduate', 'Primary School', nan]
col name: major_discipline, unique_items: [nan, 'STEM', 'Humanities', 'Business Degree', 'Other', 'Arts', 'No Major']
col name: experience, unique_items: ['2', '15', '9', '10', '13', '>20', '11', '5', '7', '8', '4', '3', '6', '14', '12', '1', '16', '19', '17', '18', '20', '<1', nan]
col name: company_size, unique_items: [nan, '10000+', '50-99', '<10', '100-500', '1000-4999', '5000-9999', '10/49', '500-999']
col name: company_type, unique_items: ['Pvt Ltd', 'NGO', 'Public Sector', 'Early Stage Startup', nan, 'Funded Startup', 'Other']
col name: last_new_job, unique_items: ['never', '3', '>4', '1', '2', '4', nan]

In [41]:
for col in categorical_columns:
    unique_items = df[col].unique().tolist()
    print(f'col name: {col}, len of unique items: {len(unique_items)}')

col name: city, len of unique items: 123
col name: gender, len of unique items: 4
col name: relevent_experience, len of unique items: 2
col name: enrolled_university, len of unique items: 4
col name: education_level, len of unique items: 6
col name: major_discipline, len of unique items: 7
col name: experience, len of unique items: 23
col name: company_size, len of unique items: 9
col name: company_type, len of unique items: 7
col name: last_new_job, len of unique items: 7

### See how many nans exist in each column:

In [42]:
from pandas import isnull
df_is_na_value = df.applymap(lambda x: isnull(x))

In [43]:
df_is_na_value = df.apply(lambda x: x.isna())

In [44]:
df_is_na_value.sum(axis=0)

city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

In [45]:
df_is_na_value.sum(axis=1)

enrollee_id
1        2
2        0
4        0
5        0
7        2
        ..
33375    0
33376    0
33377    0
33379    0
33380    0
Length: 19158, dtype: int64

# Question: What do we do with those nan values?

### A quick remark on speed issues in pandas
Let's assume we want to perform a very simple operation - we need to raise the values in the 'city_development_index' column to the second power. Let's try three approaches:
- loops
- apply() method
- builtin vectorized pandas method

##### Loop

In [46]:
%%timeit

for _, record in df.iterrows():
    record['city_development_index'] ** 2

453 ms ± 47.1 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

##### apply()

In [47]:
%%timeit

df['city_development_index'].apply(lambda x: x**2)

2.64 ms ± 226 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

##### vectorized builtin method

In [48]:
%%timeit

df['city_development_index'] ** 2

50.9 µs ± 4.96 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

### One Hot Encoding - what it is?

In [49]:
from sklearn.preprocessing import OneHotEncoder

In [59]:
encoder = OneHotEncoder()

In [61]:
encoder.fit(df[categorical_columns])

OneHotEncoder()

In [62]:
encoded = encoder.transform(df[categorical_columns])

In [63]:
encoded.shape

(19158, 192)

In [64]:
encoder.categories_

[array(['city_1', 'city_10', 'city_100', 'city_101', 'city_102',
        'city_103', 'city_104', 'city_105', 'city_106', 'city_107',
        'city_109', 'city_11', 'city_111', 'city_114', 'city_115',
        'city_116', 'city_117', 'city_118', 'city_12', 'city_120',
        'city_121', 'city_123', 'city_126', 'city_127', 'city_128',
        'city_129', 'city_13', 'city_131', 'city_133', 'city_134',
        'city_136', 'city_138', 'city_139', 'city_14', 'city_140',
        'city_141', 'city_142', 'city_143', 'city_144', 'city_145',
        'city_146', 'city_149', 'city_150', 'city_152', 'city_155',
        'city_157', 'city_158', 'city_159', 'city_16', 'city_160',
        'city_162', 'city_165', 'city_166', 'city_167', 'city_171',
        'city_173', 'city_175', 'city_176', 'city_179', 'city_18',
        'city_180', 'city_19', 'city_2', 'city_20', 'city_21', 'city_23',
        'city_24', 'city_25', 'city_26', 'city_27', 'city_28', 'city_30',
        'city_31', 'city_33', 'city_36', 'city_37', 'city_39', 'city_40',
        'city_41', 'city_42', 'city_43', 'city_44', 'city_45', 'city_46',
        'city_48', 'city_50', 'city_53', 'city_54', 'city_55', 'city_57',
        'city_59', 'city_61', 'city_62', 'city_64', 'city_65', 'city_67',
        'city_69', 'city_7', 'city_70', 'city_71', 'city_72', 'city_73',
        'city_74', 'city_75', 'city_76', 'city_77', 'city_78', 'city_79',
        'city_8', 'city_80', 'city_81', 'city_82', 'city_83', 'city_84',
        'city_89', 'city_9', 'city_90', 'city_91', 'city_93', 'city_94',
        'city_97', 'city_98', 'city_99'], dtype=object),
 array(['Female', 'Male', 'Other', nan], dtype=object),
 array(['Has relevent experience', 'No relevent experience'], dtype=object),
 array(['Full time course', 'Part time course', 'no_enrollment', nan],
       dtype=object),
 array(['Graduate', 'High School', 'Masters', 'Phd', 'Primary School', nan],
       dtype=object),
 array(['Arts', 'Business Degree', 'Humanities', 'No Major', 'Other',
        'STEM', nan], dtype=object),
 array(['1', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19',
        '2', '20', '3', '4', '5', '6', '7', '8', '9', '<1', '>20', nan],
       dtype=object),
 array(['10/49', '100-500', '1000-4999', '10000+', '50-99', '500-999',
        '5000-9999', '<10', nan], dtype=object),
 array(['Early Stage Startup', 'Funded Startup', 'NGO', 'Other',
        'Public Sector', 'Pvt Ltd', nan], dtype=object),
 array(['1', '2', '3', '4', '>4', 'never', nan], dtype=object)]

In [66]:
encoded.shape

(19158, 192)

In [67]:
from sklearn.model_selection import train_test_split

In [68]:
from xgboost import XGBClassifier

In [70]:
encoded.toarray()

array([[0., 0., 0., ..., 0., 1., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 1., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [73]:
continous_values = df[continous_columns].values

In [76]:
continous_values

array([[  0.92 , 150.   ],
       [  0.92 , 128.   ],
       [  0.92 ,  13.   ],
       ...,
       [  0.802,  27.   ],
       [  0.92 ,  81.   ],
       [  0.923, 168.   ]])

In [78]:
continous_values.shape

(19158, 2)

In [79]:
import numpy as np

In [83]:
print(encoded.toarray().shape)
print(continous_values.shape)

(19158, 192)
(19158, 2)

In [94]:
x_values = np.concatenate(
    (encoded.toarray(), continous_values), axis=1
)

In [95]:
x_values.shape

(19158, 194)

In [88]:
y_values = df['target'].values

In [90]:
y_values

array([0., 1., 0., ..., 0., 0., 0.])

In [92]:
y_values.shape

(19158,)

In [98]:
x_train, x_val, y_train, y_val = train_test_split(x_values, y_values)

In [100]:
print(x_train.shape)
print(y_train.shape)
print(x_val.shape)
print(y_val.shape)

(14368, 194)
(14368,)
(4790, 194)
(4790,)

In [101]:
model = XGBClassifier()

In [102]:
model.fit(x_train, y_train)

/home/pseweryn/Projects/ai_academy/venv/lib/python3.8/site-packages/xgboost/sklearn.py:1224: UserWarning: The use of label encoder in XGBClassifier is deprecated and will be removed in a future release. To remove this warning, do the following: 1) Pass option use_label_encoder=False when constructing XGBClassifier object; and 2) Encode your labels (y) as integers starting with 0, i.e. 0, 1, 2, ..., [num_class - 1].
  warnings.warn(label_encoder_deprecation_msg, UserWarning)

[23:46:47] WARNING: ../src/learner.cc:1115: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
              colsample_bynode=1, colsample_bytree=1, enable_categorical=False,
              gamma=0, gpu_id=-1, importance_type=None,
              interaction_constraints='', learning_rate=0.300000012,
              max_delta_step=0, max_depth=6, min_child_weight=1, missing=nan,
              monotone_constraints='()', n_estimators=100, n_jobs=8,
              num_parallel_tree=1, predictor='auto', random_state=0,
              reg_alpha=0, reg_lambda=1, scale_pos_weight=1, subsample=1,
              tree_method='exact', validate_parameters=1, verbosity=None)

In [104]:
y_pred = model.predict(x_val)

In [105]:
from sklearn.metrics import accuracy_score, f1_score, recall_score

In [106]:
y_pred_train = model.predict(x_train)

In [108]:
train_acc = accuracy_score(y_train, y_pred_train)
val_acc = accuracy_score(y_val, y_pred)

In [110]:
print(f'training accuracy: {train_acc}')

training accuracy: 0.8618457683741648

In [112]:
print(f'validation accuracy: {val_acc}')

validation accuracy: 0.7903966597077244

In [114]:
train_f1 = f1_score(y_train, y_pred_train)
val_f1 = f1_score(y_val, y_pred)

In [116]:
train_f1

0.7171155764571754

In [117]:
val_f1

0.5485611510791367